//*****************************************************************************************************************
//*****************************************************************************************************************
//*****************************************************************************************************************
/*!
 *    @file     WindowBase.cs
 *    @brief    Window基底
 *
 *    @date     2026/05/01
 *    @author   Sadakazu Motoori
 */
//*****************************************************************************************************************
//*****************************************************************************************************************
//*****************************************************************************************************************
using UnityEngine;

using R3;
using R3.Triggers;

using Cysharp.Threading.Tasks;
using Cysharp.Threading.Tasks.Triggers;

namespace SGGames.Game.Sys
{
    //==========================================================================
    /**
     *    @brief       生成・表示・破棄の状態管理を持つWindow基底クラス.
     */
    //==========================================================================
    public abstract class WindowBase : MonoBehaviour
    {
        //=============================================
        // Window状態
        //=============================================

        // Windowの処理状態.
        public enum WindowStates
        {
            None,           // 初期化前.
            Initializing,   // 初期化中.
            Initialized,    // 初期化終了.
            Showing,        // 表示処理中.
            Shown,          // 表示完了.
            Closeing,       // 終了中.
        }
        // 現在のWindow処理状態.
        public WindowStates NowState { get; set; } = WindowStates.None;

        // 表示演出が完了し、WindowManagerから安全に閉じられる状態になるまで待つ.
        public async UniTask WaitForShown() => await UniTask.WaitUntil(() => NowState == WindowStates.Shown);

        // Windowの破棄処理は、状態管理を持つWindowManagerへ依頼する.
        public async UniTask CloseWindow()
        {
            await IWindowManager.Instance.CloseWindow(this);
        }

        //=============================================
        // イベント関数
        //=============================================

        //==========================================================================
        /**
         *    @brief       非Active状態で実行される初期化処理.
         */
        //==========================================================================
        public virtual UniTask OnInitialize() => UniTask.CompletedTask;

        //==========================================================================
        /**
         *    @brief       Active状態で実行される表示処理.
         */
        //==========================================================================
        public virtual UniTask OnShow() => UniTask.CompletedTask;

        //==========================================================================
        /**
         *    @brief       Windowが破棄される直前に実行される終了処理.
         */
        //==========================================================================
        public virtual UniTask OnClose() => UniTask.CompletedTask;


    }
}
