//*****************************************************************************************************************
//*****************************************************************************************************************
//*****************************************************************************************************************
/*!
 *    @file     DebugSceneEntryPoint.cs
 *    @brief    デバッグシーン用エントリポイント
 *
 *    @date     2026/05/01
 *    @author   Sadakazu Motoori
 */
//*****************************************************************************************************************
//*****************************************************************************************************************
//*****************************************************************************************************************
using System.Threading;
using Cysharp.Threading.Tasks;
using MackySoft.Navigathena.SceneManagement;

//==========================================================================
/**
 *    @brief       デバッグシーン用のSceneEntryPoint.
 *
 *    シーン開始時に必要な初期化が増えたらここへ追加します.
 */
//==========================================================================
public sealed class DebugSceneEntoryPoint : SceneEntryPointBase
{
    //==========================================================================
    /**
     *    @brief       デバッグシーンへ入った直後の処理.
     */
    //==========================================================================
    protected override async UniTask OnEnter(ISceneDataReader reader, CancellationToken cancellationToken)
    {
        await UniTask.DelayFrame(1);
    }

    public void OnButton01(string aa)
    {
        if(UnityEngine.InputSystem.Keyboard.current != null && UnityEngine.InputSystem.Keyboard.current.aKey.wasPressedThisFrame)
        {

        }
    }
}
